<template>
  <div class="about">
    <MyContainer>
      <div class="top">
        <div class="avatar">
          <el-avatar :size="140" :src="config.avatar_img"></el-avatar>
        </div>
        <div class="info">
          <div
            class="info-list"
            v-for="title in config.aboutTitles"
            :key="title"
          >
            <i class="iconfont iconshandian"></i>
            <span v-html="title.title"></span>
          </div>
        </div>
      </div>
      <div class="contact">
        <el-avatar
          class="contact-list"
          v-for="contact in config.contacts"
          :key="contact"
          :src="contact.img_url"
          @click="toContact(contact.url)"
        >
          <img :src="config.avatar_error"
        /></el-avatar>
      </div>
    </MyContainer>

    <MyContainer>
      <div class="title shadow">安达与岛村</div>
      <div class="content">
        “我讨厌岛村在我不知道的地方露出笑容！也讨厌你和其他的人牵手！我希望你只会牵我的手！只待在我的身边！祭典也是，我很想去啊！我希望岛村很开心的时候，笑的时候，我可以在你身边！我想要那样！我头好痛，好痛苦！我一直在想岛村的事情，感觉都要……发疯了……我也在等你打电话给我！你偶尔也主动开口嘛，主动跟我说话嘛，我不想总是我单方面找你，你多少也……你一点也不在意我吗？一点也不会吗？完全不会？我对你来说不重要吗？只是朋友吗？普通的朋友吗？我希望自己不是普通的朋友，就算比普通好一点也好，我不想成为普通的……朋友……喏，岛村，我该怎么办才好？喏。岛村，你有在听吗？求你听我说话。听到我的声音有什么想法吗？会有吗？你要说会感到放心，还是什么都好，拜托有点想法。我希望你可以有点想法，还是说我不该期待这种事？岛村！我就是要岛村啊，我啊，就是想要跟岛村待在一起。我不需要岛村以外的人，不需要……只要岛村就好。我没有很任性喔，我只说比普通好一点，好一点而已啊。其他人根本就不重要，也不需要，我希望那些人都可以滚远一点，可是你为什么要去那些人身边呢？求你来我这边，来我这边，待在我身边，不要离开我。不行，在岛村身边的只能是我，我希望是我，我想待在你身边，拜托你让我待在你身边……那个女生是谁？我不认识她啊。我不想你变成我不认识的岛村，我想要了解岛村的一切，也讨厌有我不想知道的事情存在，可我更讨厌自己不知道，会更难受，会很难受，很痛苦，很痛苦……岛村……我想问你要不要一起出去玩，也想去祭典啊，我很想去啊，可是岛村为什么会跟那个女生一起去。为什么跟她一起出去玩？岛村你现在在哪里？有跟谁在一起吗？岛村，岛村……唉，你有在听吗？从刚才开始就只有我在说话啊，平常的岛村都会和我说更多话吧？唉，为什么？现在不像平常一样吗？我很奇怪吗？我很奇怪吧。这我自己都知道，可是，我想知道，我想知道岛村的一切，变得好奇怪。我不想和岛村分开，我想一直和你在一起，不管人在哪里都好，只要是跟你一起，不管待在哪里都无所谓，我好一阵子没跟岛村见面了，我好想见你，可是感觉我现在见到你会哭，而且现在真的在哭，我一直很在意那个女生到底是怎么样，唉，你有在听吗？比起跟我在一起，你比较喜欢跟她在一起吗？我不好吗？哪里不好了？我会改过的，拜托你告诉我，我会改过，我绝对会改过，所以拜托你告诉我，我想知道理由啊。岛村你……我有因为是岛村……因为是岛村才喜欢的事情，就算有其他人长得和岛村一样也不影响，虽然也不可能有人长得一模一样，唉，我不是在意岛村的外表，一定要是你才行啊。所以我才想跟你变得更要好，却好像……我不是想讲这个，我想讲其他的事情，可是我很在意……因为岛村当时脸上带着笑容啊。我讨厌你对我以外的人笑。你不讨厌吗？不会吗？岛村不会这样吗？岛村你喜欢谁？你有喜欢的人吗？你会喜欢上一个人吗？你知道什么是喜欢吗？我有时候啊，觉得好害怕。在想岛村为什么愿意陪着我。说起来，我跟岛村是朋友吧？至少有变成朋友吧？你觉得我是朋友吗？岛村对这种事……呜呜呜……呜……岛村，让我听听你的声音。我想听你的声音，听你讲讲跟我有关的事。我希望岛村是最了解我……最了解我的人。我想了解你，也希望你了解我，我希望你变成最了解我的人，我也想变成最了解你的人。我很想……可是……感觉只要发生一点不好的事情，我就会很挫折……因为岛村……感觉……不像很重视我的样子……重视……说重视也很奇怪，但是我希望你可以重视我。我就是想要你重视我！我不想跟其他人一样被归在同一类，真的只要……特别一点就好……岛村有思考过关于我的事情吗？我们暑假一直没有见面，你有想起过我一次吗？我啊，一直想着你。我一直只想着你啊。我想的全是跟岛村有关的事情。所以，岛村！你有没有常常想着我……岛村跟我不一样啊，不一样吧？这我知道，可是！我会期待，也会不小心期待起来，就算像现在这样被背……叛……我也想打电话给你。但就算打了电话，也会变成现在这样，不会解决任何问题，我改怎么办才好？唉，岛村，岛村？电话还没挂断吧？我现在还跟你通着电话吧？可是好遥远，你在好遥远的地方，我好想见你。我想直接和岛村见上一面。我希望你对我笑，希望你摸着我的头，问我有没有怎么样。你现在在哪里？在哪里？有和谁在一起吗？跟那个女生在一起吗？那个女生是谁？我从刚才就问过好多次了吧？是不能告诉我身份的人吗？你们是什么关系？跟她的交情比我好吗？不要，我不要那样，我不要你跟她的交情比我好。不要……你快说不是那样，跟我说不是那样！我满脑子想着岛村啊！还不够吗？这样还不行吗？还要更想着你才行吗？我该怎么做？我不知道该怎么做，每次思考该怎么做也总是落得失败的下场，告诉我你希望我怎么做，你告诉我的话，我会努力去做的。我绝对会努力去做的，所以，那种人我其实一点也不在乎她怎么样。我想见岛村……是更不一样的，我知道只要改变我自己就好……岛村，喏，岛村，你现在在想什么？你觉得我很奇怪吗？觉得我有病吗？说说你的想法好吗？你主动跟我说话，主动接近我好吗？每次都是我……都是我，都是我……单方面地接近一个人，就会变成现在这样啊！就是因为会变成现在这样，所以岛村也，来我这边好吗？岛村讨厌我吗？不讨厌吧？不要，你不要讨厌我。我不要你讨厌我。我不想要你讨厌我……我希望你喜欢……我希望你喜欢我。我希望你喜欢上一个人。不对，是岛村你要喜欢……你讨厌我吗？你跟我妈妈一样讨厌我吗？你以后不再跟我妈妈说话了吗？会把我当成不认识的人吗？我该怎么说才好？我该做什么才好？要飞起来吗？要跳起来吗？要牵你的手吗？这些我都想做，可是真的做了你又不会看着我……我到底该怎么做才好？我该怎么做……没有人……岛村，我……好想听你的声音……求你说点什么，让我放心，可是我不要你对别人笑，只对我笑，对我笑……头好痛，肚子也……好痛……明明就很在意，可是你……为什么不跟我联络呢？告诉我，我好想知道。我好想了解岛村，我从刚才开始，就觉得心里好混乱……我一直在说一样的话，可是这也没办法啊，就是没办法啊。我就是指想着岛村啊……就是只想着岛村，所以就算变得一直在想岛村……我也很重视岛村，很想好好珍惜你，我不要自己不重视你，所以……拜托你看着我。我不要岛村不看着我……我不要你……看着别人……我不要那样。你又要跟她一起出去玩吗？要跟她去哪里吗？一起到市区那里去吗？跟那个女生一起……到曾经跟我一起去玩的地方吗！我不要你那样。不要去掉我跟你的回忆啊！我一直记得那些回忆，你却要忘记……你又跟她出去玩的话，这次会不一样吗？会在看着同样的地方的时候，看到不一样的东西吗？我不要你那样，我不要，我不要。我想待在岛村身边，和你一起分享，互相了解……这样太奇怪了啊。不对吧？是我很奇怪，我知道自己这样很奇怪，可是就是会变得很奇怪……我没办法不想着岛村……就算是现在，也……岛村，岛村，岛……村……呜呜……呜……呜呜呜呜，岛村，岛村……唔，咳……呜呜……岛村的……岛村？岛村，岛村，岛村……我就是要岛村，我……就是要待在岛村身边，所以岛村也……喏，求求你，岛村……岛村也……岛村……”
      </div>
    </MyContainer>
  </div>
</template>

<script setup>
import MyContainer from '@/components/MyContainer/index.vue'
import config from '@/config'

const toContact = (url) => {
  window.open(url)
}
</script>

<style lang="stylus" scoped>
.about {
  .my-container {
    padding 20px
    position relative
    .title{
      position absolute
      left -40px
      background: $baseColor
      color #fff
      padding 6px
      font-size 20px
      }
    .content{
      padding-top 60px
      font-size 18px
      color #380845
      }
    .top {
      display flex
      .avatar {
        width 8.75rem
        height 8.75rem
      }
      .info {
        margin-left 50px
        .info-list {
          margin 10px 0
        }
      }
    }
    .contact {
      margin-top 20px
      text-align center
      display flex
      justify-content center
      .el-avatar {
        margin 0 20px
      }
      .contact-list {
        // padding 0 20px
        cursor $my-cursor-pointer
        // border 3px solid !important
        &:hover {
          // color $baseColor
        }
      }
    }
  }
}
</style>
